Revit 2027 API
BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterWarning Property
 This is used to post warning. "Bar Engagement 2" has an incorrect value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SecondaryEngagementParameterWarning { get; }
Public Shared ReadOnly Property SecondaryEngagementParameterWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SecondaryEngagementParameterWarning {
	FailureDefinitionId^ get ();
}
static member SecondaryEngagementParameterWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace